README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-04-26 Wed 09:48 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Hydrodynamic calculation on microswimmers</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Gary Klindt" />
<link rel="stylesheet" type="text/css" href="README.css" />
</head>
<body>
<div id="content">
<h1 class="title">Hydrodynamic calculation on microswimmers</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline4">1. install instructions</a>
<ul>
<li><a href="#orgheadline1">1.1. chlamymodel</a></li>
<li><a href="#orgheadline2">1.2. friction matrix</a></li>
<li><a href="#orgheadline3">1.3. library usage</a></li>
</ul>
</li>
<li><a href="#orgheadline8">2. example files</a>
<ul>
<li><a href="#orgheadline5">2.1. <code>example_chlamymodel</code></a></li>
<li><a href="#orgheadline6">2.2. <code>example_computing_friction</code></a></li>
<li><a href="#orgheadline7">2.3. <code>example_sperm_swimming</code></a></li>
</ul>
</li>
<li><a href="#orgheadline9">3. create the documentation</a></li>
</ul>
</div>
</div>
<p>
Library and executable code can be used with <code>python3</code>.
</p>

<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4"><span class="section-number-2">1</span> install instructions</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1"><span class="section-number-3">1.1</span> chlamymodel</h3>
<div class="outline-text-3" id="text-1-1">
<p>
The chlamymodel library relies on pre-calculated friction matrices
that are saved in the python<sub>internal</sub> pickle format. Those are
provided in the folder install<sub>data</sub> and have to be copied into your
<code>${HOME}</code> folder:
</p>

<div class="org-src-container">

<pre class="src src-sh">mkdir -p ~/.chlamymodel
cp install_data/*.pickle ~/.chlamymodel
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">1.2</span> friction matrix</h3>
<div class="outline-text-3" id="text-1-2">
<p>
The friction matrices themselves are created with a pre-compiled
program utilizing the fast-multipole boundary element
method. Executable files for Windows and Linux as well as two
configuration files are installed as follows:
</p>

<div class="org-src-container">

<pre class="src src-sh">mkdir -p ~/.FMBEM
cp install_data/*.exe ~/.FMBEM
cp install_data/*.cnd ~/.FMBEM
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">1.3</span> library usage</h3>
<div class="outline-text-3" id="text-1-3">
<p>
To use the python libraries, set the python path accordingly
</p>

<div class="org-src-container">

<pre class="src src-sh"><span style="color: #eee8aa;">export</span> <span style="color: #f0e68c; font-weight: bold;">PYTHONPATH</span>=$<span style="color: #ffd700;">{</span><span style="color: #f0e68c; font-weight: bold;">PYTHONPATH</span><span style="color: #ffd700;">}</span>:$<span style="color: #ffd700;">{</span><span style="color: #f0e68c; font-weight: bold;">this_install</span><span style="color: #ffd700;">}</span>
</pre>
</div>

<p>
with <code>${this_install}</code> being the folder in which this README file is
saved.
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline8" class="outline-2">
<h2 id="orgheadline8"><span class="section-number-2">2</span> example files</h2>
<div class="outline-text-2" id="text-2">
<p>
The folders <code>example_*</code> contain python files that can be executed when
the files in <code>install_data</code> are copied to their appropriate places,
see <a href="#orgheadline4">install intructions</a>.
</p>
</div>

<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5"><span class="section-number-3">2.1</span> <code>example_chlamymodel</code></h3>
</div>

<div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6"><span class="section-number-3">2.2</span> <code>example_computing_friction</code></h3>
</div>

<div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7"><span class="section-number-3">2.3</span> <code>example_sperm_swimming</code></h3>
</div>
</div>


<div id="outline-container-orgheadline9" class="outline-2">
<h2 id="orgheadline9"><span class="section-number-2">3</span> create the documentation</h2>
<div class="outline-text-2" id="text-3">
<p>
A documentation web-page can be generated using sphinx. For this
aim, install sphinx. Then execute <code>sphinx-quickstart</code> from within the
<code>doc</code> folder. It is important, that you do <b>not</b> overwrite the file
<code>doc/index/rst</code>. Also, make use of the <code>autodoc</code> feature. Then, execute
from within the <code>doc</code> folder:
</p>

<div class="org-src-container">

<pre class="src src-sh">./apidoc-everything <span style="color: #cd5c5c;"># </span><span style="color: #cd5c5c;">creates the documentation files for the modules</span>
make html           <span style="color: #cd5c5c;"># </span><span style="color: #cd5c5c;">generates html from them</span>
</pre>
</div>

<p>
Then, there should be a folder <code>_build/html</code> containing the file
<code>index.html</code>, which is to be opened in a web browser.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Gary Klindt</p>
<p class="date">Created: 2017-04-26 Wed 09:48</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
